app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "3"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'George Lucas'
---
  def find_similar_director
    id = params[:id] # retrieve movie ID from URI route
    @movie = Movie.find(id) # look up movie by unique ID
    @movies_list=Movie.find_similar_movies(@movie)
    if @movie.director == nil || @movie.director.empty?

UPDATE "movies" SET "director" = 'Ridley Scott', "updated_at" = '2016-03-30 05:07:40.101913' WHERE "movies"."id" = 3
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(params[:movie])